FluidisedBed/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}
dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 0.0;
boundaryField
{
   

    inlet
    {
        type zeroGradient;
    }

    outlet
    {
        type totalPressure;
        p0 uniform 0;
        value uniform 0;
        rho none;
        psi none;
        U U;
        phi phi;
        gamma 1.0;
    }

    cylinder
    {
        type zeroGradient;
    }

}
